# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Thu Mar 12 10:41:41 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design systolic_array_4x4

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {activation_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {weight_in[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[127]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[126]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[125]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[124]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[123]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[122]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[121]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[120]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[119]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[118]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[117]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[116]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[115]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[114]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[113]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[112]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[111]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[110]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[109]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[108]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[107]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[106]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[105]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[104]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[103]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[102]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[101]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[100]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[99]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[98]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[97]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[96]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[95]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[94]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[93]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[92]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[91]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[90]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[89]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[88]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[87]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[86]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[85]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[84]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[83]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[82]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[81]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[80]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[79]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[78]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[77]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[76]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[75]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[74]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[73]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[72]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[71]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[70]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[69]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[68]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[67]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {result_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports done]
set_wire_load_mode "enclosed"
